app/controllers/books_controller.rb

  def index
    if params[:category].blank?
      @books = Book.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @books = Book.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fantasy"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ? ORDER BY created_at DESC  [["category_id", 1]]

  def show
    if @book.reviews.blank?
      @average_review = 0
    else
      @average_review = @book.reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 8]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 8]]

  def new
    @book = current_user.books.build
    @categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

  def create
    @book = current_user.books.build(book_params)
    @book.category_id = params[:category_id]

    if @book.save
---
INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id", "book_img_file_name", "book_img_content_type", "book_img_file_size", "book_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @book.category_id = params[:category_id]
    if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "A Game of Thrones (A Song of Ice and Fire, Book 1)!"], ["updated_at", 2016-11-11 02:20:47 UTC], ["id", 1]]