app/controllers/reviews_controller.rb

UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "What a great book!"], ["updated_at", 2016-11-12 21:04:23 UTC], ["id", 1]]
---
  def update

    if @review.update(review_params)

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "What a great book."], ["created_at", 2016-11-12 20:08:42 UTC], ["updated_at", 2016-11-12 20:08:42 UTC], ["user_id", 1], ["book_id", 8]]
---
  def create
    @review = Review.new(review_params)
    @review.book_id = @book.id
    @review.user_id = current_user.id

    if @review.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def find_book
      @book = Book.find(params[:book_id])